package itsa;

import java.util.Scanner;  
  
public class Q1{  
  
    public static void main(String[] args) {  
          
    	//數字0~9 分別用5X5字串表示
    	String number[][] =   
            {  
               {"*****",
                "*   *",
                "*   *",
                "*   *",
                "*****"}, //0  
               
               {"    *",
                "    *",
                "    *",
                "    *",
                "    *"}, //1  
               
               {"*****",
                "    *",
                "*****",
                "*    ",
                "*****"}, //2  
               
               {"*****",
                "    *",
                "*****",
                "    *",
                "*****"}, //3 
               
               {"*   *",
                "*   *",
                "*****",
                "    *",
                "    *"}, //4  
               
               {"*****",
                "*    ",
                "*****",
                "    *",
                "*****"}, //5  
               
               {"*    ",
                "*    ",
                "*****",
                "*   *",
                "*****"}, //6  
               
               {"*****",
                "    *",
                "    *",
                "    *",
                "    *"}, //7  
               
               {"*****",
                "*   *",
                "*****",
                "*   *",
                "*****"}, //8  
               
               {"*****",
                "*   *",
                "*****",
                "    *",
                "    *"}, //9  
              
            };  
            
            //讓使用者輸入四位數
            Scanner sc = new Scanner(System.in);  
            int input= sc.nextInt();  
               
            //用array分別儲存使用者輸入的四個數
            int[] output = new int[4];  
           
            //把每次除以10的餘數儲存下來 就可以分別儲存四個數字
            //e.g.  345/10= 34...5  
            //      34 /10= 3....4
            //		3  /10= 0....3
            //                   存下餘數為543(為345的倒數)
            for(int i=3; i>=0; i--) {  //因為是倒數 所以i從3開始，這樣儲存才會是345原先的順序
                output[i] = input%10;  //存餘數
                input = input/10;  	   //繼續除以10
            }  
              
            //把每個數從第0行開始印出 -> 第1行.... -> 第4行....
            for(int i=0; i<5; i++) {  
                for(int j=0; j<4; j++) { 
                	
                    int tmp = output[j]; 
                    System.out.print(number[tmp][i]);
                    
                    //每個數之間要有空白，但第四個數字後面不用
                    if(j!=3)  
                        System.out.print(" ");  
                }  
                
                //印完該行 就換行
                System.out.println();  
            }  
        }} 